# FilteredWorksetCollector Properties

---
The FilteredWorksetCollector type exposes the following members.
| Name| Description
---|---|---
| IsValidObject|  Specifies whether the .NET object represents a valid Revit entity.
Top
#### Reference
FilteredWorksetCollector Class
Autodesk.Revit.DB Namespace